#===============================================================================
# Лабораторная работа №3
# Исследование работы L2-регуляризатора в задачах регрессии
# Цель работы: изучить особенности работы L2-регуляризатора на примере задачи
# аппроксимации функции линейной моделью
#
#
# Задания на лабораторную работу (по вариантам)
# 1. Вам  необходимо  аппроксимировать  (описать)  функцию  своего  варианта  с
# помощью линейной модели:
#
# 2.  Обучающую  выборку  следует  составить  из  всех  четных  индексов
# сгенерированных значений функции:
#
# 3.  После  этого,  вычислите  значения  коэффициентов  вектора    для
# квадратической  функции  потерь  (в  задачах  регрессии,  обычно,  используют
# именно такую функцию потерь), которые минимизируют эмпирический риск:
#
# 4. Вычислите прогнозы функции с помощью полученной модели    a x  для всего
# диапазона  значений. (В  отсчетах,  не  участвующих  в  выборке,  значения  модели
# должны сильно расходиться с целевыми.)
# 5. Вычислите коэффициенты вектора с регуляризатором по формуле:
#
# - единичная матрица.
# 6. Для  новой  модели    a x  повторите  вычисление прогнозов функции для  всего
# диапазона значений.
# P.S.  Все  программы  реализовать  на  языке Python  с  использованием  пакетов
# NumPy и Matplotlib.
#===============================================================================


if __name__ == "__main__":
    pass
